DataProcessors/ДвиженияДокументовПоОтгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ДвиженияДокументовПоОтгрузке</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/БольшаяЯчеистаяСборка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>БольшаяЯчеистаяСборка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвижениеТары</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТарыПоШК</xr:Item>
				<xr:Item>AccumulationRegister.ЗонаОтгрузки</xr:Item>
				<xr:Item>InformationRegister.РегТарыПоШК</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходитВКомплект</Name>
					<Comment>Данный Документ входит в комплектом сборок</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСписания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеТовараСЗоныОтгрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКоробокПриПроверке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектБЯС</Name>
					<Comment>Документ комплект в котый входит данная сборка</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коробки</Name>
					<Comment>Количество коробок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПоказыватьВСписке</Name>
					<Comment>Не показывать в списке НЕ РАСПРЕДЕЛЕННЫХ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомераСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийОбъем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПогрузкаВАвто</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПогрузкаТоваровВАвтомобиль</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПутевойЛист_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшивкиРаспечатанны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реестр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реестр</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Самовывоз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатыРаспечатаны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСборки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеСборки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Списан</Name>
					<Comment>Списание товара с зоны отгрузки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокМестХранений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СформированВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКомплект</Name>
					<Comment>Данный Документ Является комплектом сборок</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолТара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратВодителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратПоставщику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресаДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыРасхода</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Док</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетФ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проверен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолПозиций</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АдресаДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МестаОтгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоОтгрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКоробок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыКомплекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокБЯС</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Тара</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контейнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Тара</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ДвиженияДокументовПоОтгрузке/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокДокВПутевыхЛистахВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		ОткрытьЗначение(Элементы.СписокДокВПутевыхЛистах.ТекущиеДанные.ПутевойЛист);
КонецПроцедуры

&НаКлиенте
Процедура СписокДокУВодителяВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//ОткрытьЗначение(Элементы.СписокДокУВодителя.ТекущиеДанные.ДокументПрихода);

КонецПроцедуры

&НаКлиенте
Процедура СписокДокПогрузкаВАвтоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элементы.СписокДокПогрузкаВАвто.ТекущиеДанные.ДокументПрихода);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьПутевыеЛисты(Команда)
	
Если Вопрос("Удалить выбранные путевые листы?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
	Возврат;	
КонецЕсли;

	
	масИД=Элементы.СписокДокВПутевыхЛистах.ВыделенныеСтроки;
	Если масИД.Количество()=0 Тогда
		Сообщить("Ничего не выбрано.");
		Возврат;
	КонецЕсли;
	
	масДок=Новый Массив;
	
	Для Каждого эл_масИД Из масИД Цикл
		//Сообщить(Элементы.СписокДокВПутевыхЛистах.ДанныеСтроки(эл_масИД).ПутевойЛист);
	масДок.Добавить(Элементы.СписокДокВПутевыхЛистах.ДанныеСтроки(эл_масИД).ПутевойЛист);	
	КонецЦикла;
	 УдалитьПутевыеЛистыСервер(масДок);
	 
	 Элементы.СписокДокВПутевыхЛистах.Обновить();
КонецПроцедуры

&НаСервере
Процедура  УдалитьПутевыеЛистыСервер(масДок)
	
	ТЗдок=Новый ТаблицаЗначений;
	ТЗдок.Колонки.Добавить("ДокСсылка");
	Для Каждого эл_масДок Из масДок Цикл
		новСтрока=ТЗдок.Добавить();
		новСтрока.ДокСсылка=эл_масДок;
	КонецЦикла;
	
	ТЗдок.Свернуть("ДокСсылка");
	Для Каждого стр_ТЗдок Из ТЗдок Цикл
		Сообщить(Строка(стр_ТЗдок.ДокСсылка)+"-Удален");
		стр_ТЗдок.ДокСсылка.ПолучитьОбъект().Удалить();
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьВыделенныхБЯС(Команда)
	масСтрок=Элементы.СписокДокВПутевыхЛистах.ВыделенныеСтроки;
	масДок=Новый Массив;
	Для Каждого эл_масСтрок Из масСтрок Цикл
		докБЯС=Элементы.СписокДокВПутевыхЛистах.ДанныеСтроки(эл_масСтрок).ДокументПрихода;
		Сообщить(докБЯС);
		масДок.Добавить(докБЯС);		
		
	КонецЦикла;
	//ТД=Новый ТабличныйДокумент;
	ТД=ПечатьВыделенныхБЯССЕРВЕР(масДок);
	  	
	ТД.Показать();
КонецПроцедуры
 &НаСервере
 Функция ПечатьВыделенныхБЯССЕРВЕР(масДок) 
	 
	 ТД=Новый ТабличныйДокумент;
	  ТД_БЯС=Новый ТабличныйДокумент;

     Для Каждого эл_масДок Из масДок Цикл
		//Сообщить(докБЯС);
        Документы.БольшаяЯчеистаяСборка.Печать(ТД_БЯС,эл_масДок);
		ТД.Вывести(ТД_БЯС);
	КонецЦикла;

	 	
	Возврат ТД;
	 
 КонецФункции


&НаКлиенте
 Процедура СоздатьПриемТовараВодителем(Команда)
	 Если Вопрос("Создать документы ПриемТовараВодителем?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		 Возврат;	
	 КонецЕсли;
	 
	 масВыбранныхСтрок=Элементы.СписокДокВПутевыхЛистах.ВыделенныеСтроки;
	 масСтрок=Новый Массив;
	 Для Каждого эл_масВыбранныхСтрок Из масВыбранныхСтрок Цикл
		 масСтрок.Добавить(Элементы.СписокДокВПутевыхЛистах.ДанныеСтроки(эл_масВыбранныхСтрок));	// 
	 КонецЦикла;
	 
	 СоздатьПриемТовараВодителемСервер(масСтрок);
	 Элементы.СписокДокВПутевыхЛистах.Обновить();
	 
		
 КонецПроцедуры
 
 &НаСервере
 Процедура СоздатьПриемТовараВодителемСервер(масСтрок)
	 
	Для Каждого эл_масСтрок Из масСтрок Цикл
	новыйДок=Документы.ПриемТовараВодителем.СоздатьДокумент();
	новыйДок.Дата=ТекущаяДата();
	новыйДок.Водитель=эл_масСтрок.ПутевойЛист.Водитель;
	новыйДок.Подразделение=Справочники.Подразделения.НайтиПоНаименованию(СокрЛП(эл_масСтрок.ДокументПрихода.Организация));;
	новыйДок.ДокБЯС=эл_масСтрок.ДокументПрихода;
	новыйДок.НомераСФ= эл_масСтрок.ДокументПрихода.НомераСФ;
	новыйДок.КоличествоКоробок=эл_масСтрок.ДокументПрихода.Коробки;
	новыйДок.КоличествоКоробокПриПроверке=эл_масСтрок.ДокументПрихода.Коробки;
	новыйДок.ОбщийВес=эл_масСтрок.ДокументПрихода.ОбщийВес;
	новыйДок.ОбщийОбъем=эл_масСтрок.ДокументПрихода.ОбщийОбъем;
	новыйДок.ПутевойЛист=эл_масСтрок.ПутевойЛист;
	//Заполняем ТЧ МестаОтгрузки
	Для Каждого эл_ТЧместоОтгрузки Из эл_масСтрок.ДокументПрихода.МестаОтгрузки Цикл
		новМестоОтгрузки=новыйДок.МестаОтгрузки.Добавить();
		новМестоОтгрузки.МестоОтгрузки= эл_ТЧместоОтгрузки.МестоОтгрузки;
		новМестоОтгрузки.ДокументПрихода=эл_масСтрок.ДокументПрихода;
		новМестоОтгрузки.КоличествоКоробок =эл_ТЧместоОтгрузки.КоличествоКоробок;
		новМестоОтгрузки.Контрагент   =эл_масСтрок.ДокументПрихода.Получатель;
		новМестоОтгрузки.ПутевойЛист=эл_масСтрок.ПутевойЛист;
	КонецЦикла;
	//Заполняем ТЧ ДокументыРасхода
	Для Каждого эл_ТЧДокументыРасхода Из эл_масСтрок.ДокументПрихода.ДокументыРасхода Цикл
		новДокРасхода=новыйДок.ДокументыРасхода.Добавить();
		новДокРасхода.Док= эл_ТЧДокументыРасхода.Док;
		новДокРасхода.СчетФ =эл_ТЧДокументыРасхода.СчетФ;
		новДокРасхода.ШК= эл_ТЧДокументыРасхода.ШК;
		новДокРасхода.ДокНомер= эл_ТЧДокументыРасхода.ДокНомер;
		новДокРасхода.Проверен= Истина;
		
	КонецЦикла;
	
	новыйДок.Записать(РежимЗаписиДокумента.Проведение);
     КонецЦикла;

 КонецПроцедуры

&НаКлиенте
 Процедура СоздатьПогрузкаВАвто(Команда)
	  Если Вопрос("Создать документы ПогрузкаТоваровВАвтомобиль?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		 Возврат;	
	 КонецЕсли;
	 
	 Если Не ЗначениеЗаполнено(ЭтаФорма.РаботникОхраны) Тогда
		 Сообщить("Не выбран работник охраны.");
		 Возврат;	 
	 КонецЕсли;
	 
		 
	 масВыбранныхСтрок=Элементы.СписокДокУВодителяРЕГИСТР.ВыделенныеСтроки;
	 масСтрок=Новый Массив;
	 Для Каждого эл_масВыбранныхСтрок Из масВыбранныхСтрок Цикл
		 масСтрок.Добавить(Элементы.СписокДокУВодителяРЕГИСТР.ДанныеСтроки(эл_масВыбранныхСтрок));	// 
	 КонецЦикла;
	 
	 СоздатьПогрузкаВАвтоСЕРВЕР(масСтрок);
	 Элементы.СписокДокУВодителяРЕГИСТР.Обновить();

 КонецПроцедуры
 
 &Насервере
 Процедура  СоздатьПогрузкаВАвтоСЕРВЕР(масСтрок)
	Для Каждого эл_масСтрок Из масСтрок Цикл
		
		докПриемТовараВодителем=эл_масСтрок.ДокументПрихода;
		
		новыйДок=Документы.ПогрузкаТоваровВАвтомобиль.СоздатьДокумент();
		новыйДок.Дата=ТекущаяДата();
		новыйДок.Водитель=докПриемТовараВодителем.Водитель;
		новыйДок.КоличествоКоробок=докПриемТовараВодителем.КоличествоКоробок;
		новыйДок.ОбщийВес=докПриемТовараВодителем.ОбщийВес;
		новыйДок.ОбщийОбъем=докПриемТовараВодителем.ОбщийОбъем;
		новыйДок.Подразделение=докПриемТовараВодителем.Подразделение;
		новыйДок.РаботникОхраны=ЭтаФорма.РаботникОхраны;
		
		новыйДок.Контрагент=докПриемТовараВодителем.Контрагент;
		
		новыйДок.ПутевойЛист=докПриемТовараВодителем.ПутевойЛист;
		новыйДок.ДокументОснование=докПриемТовараВодителем;
		
		новыйДок.ДокументыРасхода.Загрузить(докПриемТовараВодителем.ДокументыРасхода.Выгрузить());
		новыйДок.МестаОтгрузки.Загрузить(докПриемТовараВодителем.МестаОтгрузки.Выгрузить());
		
		новыйДок.Записать(РежимЗаписиДокумента.Проведение);

		Сообщить("Создан документ-"+НовыйДок);
		
	КонецЦикла;
	 
 КонецПроцедуры
